In [2]:
import pandas as pd

In [22]:

df = pd.read_csv("https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user", sep='|')
df.head()

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

In [5]:
df['occupation'].unique()

array(['technician', 'other', 'writer', 'executive', 'administrator',
       'student', 'lawyer', 'educator', 'scientist', 'entertainment',
       'programmer', 'librarian', 'homemaker', 'artist', 'engineer',
       'marketing', 'none', 'healthcare', 'retired', 'salesman', 'doctor'],
      dtype=object)

In [19]:
df.set_index('occupation',inplace=True)

In [26]:
df.groupby( by='occupation')['occupation'].count().idxmin()

'doctor'

In [28]:
df['occupation'].value_counts().idxmin()

'homemaker'

In [29]:
df1=df.head()

In [30]:
df1

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

In [42]:
df.groupby( by='age')['age'].count().idxmin()

7

In [44]:
df['age'].value_counts().idxmin()

11

In [45]:
df['age']. mode()

0    30
dtype: int64